## <center> Exploring NYC Public School Test Result Scores <center>

***Refer to the schools.csv dataset***

In [1]:
#import the required libraries
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
#import data
df = pd.read_csv("C:/Users/uyen/Desktop/Real-World-Projects/Python/datasets/schools.csv")
df.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

**Which NYC schools have the best math results?**

The best math results are at least 80% of the *maximum possible score of 800* for math.
Save your results in a pandas DataFrame called best_math_schools, including "school_name" and "average_math" columns, sorted by "average_math" in descending order.

In [5]:
#calculate the best math score
best_math_score = 0.80 * 800
best_math_score

640.0

In [6]:
#create the best_math_schools df
best_math_schools = df[df["average_math"] >= best_math_score]
best_math_schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
45,Eleanor Roosevelt High School,Manhattan,M855,641,617,631,86.0
68,"High School for Mathematics, Science, and Engi...",Manhattan,M812,683,610,596,92.6
88,Stuyvesant High School,Manhattan,M477,754,697,693,97.4
93,Staten Island Technical High School,Staten Island,R440,711,660,670,99.7

In [7]:
#select only school_name and sort by average_math descending
best_math_schools = best_math_schools[["school_name", "average_math"]]
best_math_schools = best_math_schools.sort_values("average_math", ascending = False)
best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

**What are the top 10 performing schools based on the combined SAT scores?**

Save your results as a pandas DataFrame called top_10_schools containing the "school_name" and a new column named "total_SAT", with results ordered by "total_SAT" in descending order ("total_SAT" being the sum of math, reading, and writing scores).

In [8]:
#calculate the total_SAT score
df["total_SAT"] = df["average_math"] + df["average_reading"] + df["average_writing"]
df.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,total_SAT
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN,1859
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9,1193
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1,1261
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9,1529
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7,1197

In [9]:
#sort by total_SAT
df_sorted = df.sort_values(["total_SAT"], ascending = False)
df_sorted.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,total_SAT
88,Stuyvesant High School,Manhattan,M477,754,697,693,97.4,2144
170,Bronx High School of Science,Bronx,X445,714,660,667,97.0,2041
93,Staten Island Technical High School,Staten Island,R440,711,660,670,99.7,2041
174,High School of American Studies at Lehman College,Bronx,X905,669,672,672,91.8,2013
333,Townsend Harris High School,Queens,Q515,680,640,661,97.1,1981

In [10]:
#list out the top 10 schools
top_10_schools = df_sorted[["school_name","total_SAT"]].head(10)
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

**Which single borough has the largest standard deviation in the combined SAT score?**

* Save your results as a pandas DataFrame called largest_std_dev.
* The DataFrame should contain one row, with:
    * "borough" - the name of the NYC borough with the largest standard deviation of "total_SAT".
    * "num_schools" - the number of schools in the borough.
    * "average_SAT" - the mean of "total_SAT".
    * "std_SAT" - the standard deviation of "total_SAT".
* Round all numeric values to two decimal places.

In [12]:
#list out unique boroughs
borough = list(df["borough"].unique())
borough

['Manhattan', 'Staten Island', 'Bronx', 'Queens', 'Brooklyn']

In [13]:
#for loop to calculate the number of schools, average SAT score, and standard deviation of the SAT score
l = []
for i in borough:
    df_i = df[df["borough"] == i]
    num_schools = len(df_i["school_name"].unique())
    mean = round(np.mean(df_i["total_SAT"]), 2)
    std = round(np.std(df_i["total_SAT"], ddof = 1),2)
    l.append([i, num_schools, mean, std])

In [14]:
l = pd.DataFrame(l, columns = ["borough", "num_schools", "average_SAT", "std_SAT"], index = None)
largest_std_dev = l[l["std_SAT"] == np.max(l["std_SAT"])]
largest_std_dev

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29